/*
* Copyright 1993-2010 NVIDIA Corporation.  All rights reserved.
*
* NOTICE TO USER:
*
* This source code is subject to NVIDIA ownership rights under U.S. and
* international Copyright laws.
*
* NVIDIA MAKES NO REPRESENTATION ABOUT THE SUITABILITY OF THIS SOURCE
* CODE FOR ANY PURPOSE.  IT IS PROVIDED "AS IS" WITHOUT EXPRESS OR
* IMPLIED WARRANTY OF ANY KIND.  NVIDIA DISCLAIMS ALL WARRANTIES WITH
* REGARD TO THIS SOURCE CODE, INCLUDING ALL IMPLIED WARRANTIES OF
* MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE.
* IN NO EVENT SHALL NVIDIA BE LIABLE FOR ANY SPECIAL, INDIRECT, INCIDENTAL,
* OR CONSEQUENTIAL DAMAGES, OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS
* OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE
* OR OTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE
* OR PERFORMANCE OF THIS SOURCE CODE.
*
* U.S. Government End Users.  This source code is a "commercial item" as
* that term is defined at 48 C.F.R. 2.101 (OCT 1995), consisting  of
* "commercial computer software" and "commercial computer software
* documentation" as such terms are used in 48 C.F.R. 12.212 (SEPT 1995)
* and is provided to the U.S. Government only as a commercial end item.
* Consistent with 48 C.F.R.12.212 and 48 C.F.R. 227.7202-1 through
* 227.7202-4 (JUNE 1995), all U.S. Government End Users acquire the
* source code with only those rights set forth herein.
*/
#ifndef _npp_staging_h_
#define _npp_staging_h_


/**
* \file npp_staging.h
* NPP Staging Library (will become part of NPP next release)
*/


#ifdef __cplusplus


/** \defgroup ctassert Compile-time assert functionality
* @{
*/


    /**
     * Compile-time assert namespace
     */
    namespace NppStCTprep
    {
        template <bool x>
        struct CT_ASSERT_FAILURE;

        template <>
        struct CT_ASSERT_FAILURE<true> {};

        template <int x>
        struct assertTest{};
    }


    #define NPPST_CT_PREP_PASTE_AUX(a,b)      a##b                           ///< Concatenation indirection macro
    #define NPPST_CT_PREP_PASTE(a,b)          NPPST_CT_PREP_PASTE_AUX(a, b)  ///< Concatenation macro


    /**
     * Performs compile-time assertion of a condition on the file scope
     */
    #define NPPST_CT_ASSERT(X) \
        typedef NppStCTprep::assertTest<sizeof(NppStCTprep::CT_ASSERT_FAILURE< (bool)(X) >)> \
        NPPST_CT_PREP_PASTE(__ct_assert_typedef_, __LINE__)


/*@}*/


#endif


/** \defgroup typedefs NPP Integral and compound types of guaranteed size
 * @{
 */


typedef               bool NppStBool; ///< Bool of size less than integer
typedef          long long NppSt64s;  ///< 64-bit signed integer
typedef unsigned long long NppSt64u;  ///< 64-bit unsigned integer
typedef                int NppSt32s;  ///< 32-bit signed integer
typedef       unsigned int NppSt32u;  ///< 32-bit unsigned integer
typedef              short NppSt16s;  ///< 16-bit signed short
typedef     unsigned short NppSt16u;  ///< 16-bit unsigned short
typedef               char NppSt8s;   ///< 8-bit signed char
typedef      unsigned char NppSt8u;   ///< 8-bit unsigned char
typedef              float NppSt32f;  ///< 32-bit IEEE-754 (single precision) float
typedef             double NppSt64f;  ///< 64-bit IEEE-754 (double precision) float


/**
 * 2D Rectangle, 8-bit unsigned fields
 * This struct contains position and size information of a rectangle in two space
 */
struct NppStRect8u
{
    NppSt8u x;          ///< x-coordinate of upper left corner
    NppSt8u y;          ///< y-coordinate of upper left corner
    NppSt8u width;      ///< Rectangle width
    NppSt8u height;     ///< Rectangle height
#ifdef __cplusplus
    NppStRect8u() : x(0), y(0), width(0), height(0) {};
    NppStRect8u(NppSt8u x, NppSt8u y, NppSt8u width, NppSt8u height) : x(x), y(y), width(width), height(height) {}
#endif
};


/**
 * 2D Rectangle, 32-bit signed fields
 * This struct contains position and size information of a rectangle in two space
 */
struct NppStRect32s
{
    NppSt32s x;          ///< x-coordinate of upper left corner
    NppSt32s y;          ///< y-coordinate of upper left corner
    NppSt32s width;      ///< Rectangle width
    NppSt32s height;     ///< Rectangle height
#ifdef __cplusplus
    NppStRect32s() : x(0), y(0), width(0), height(0) {};
    NppStRect32s(NppSt32s x, NppSt32s y, NppSt32s width, NppSt32s height) : x(x), y(y), width(width), height(height) {}
#endif
};


/**
 * 2D Rectangle, 32-bit unsigned fields
 * This struct contains position and size information of a rectangle in two space
 */
struct NppStRect32u
{
    NppSt32u x;          ///< x-coordinate of upper left corner
    NppSt32u y;          ///< y-coordinate of upper left corner
    NppSt32u width;      ///< Rectangle width
    NppSt32u height;     ///< Rectangle height
#ifdef __cplusplus
    NppStRect32u() : x(0), y(0), width(0), height(0) {};
    NppStRect32u(NppSt32u x, NppSt32u y, NppSt32u width, NppSt32u height) : x(x), y(y), width(width), height(height) {}
#endif
};


/**
 * 2D Size, 32-bit signed fields
 * This struct typically represents the size of a a rectangular region in two space
 */
struct NppStSize32s
{
    NppSt32s width;  ///< Rectangle width
    NppSt32s height; ///< Rectangle height
#ifdef __cplusplus
    NppStSize32s() : width(0), height(0) {};
    NppStSize32s(NppSt32s width, NppSt32s height) : width(width), height(height) {}
#endif
};


/**
 * 2D Size, 32-bit unsigned fields
 * This struct typically represents the size of a a rectangular region in two space
 */
struct NppStSize32u
{
    NppSt32u width;  ///< Rectangle width
    NppSt32u height; ///< Rectangle height
#ifdef __cplusplus
    NppStSize32u() : width(0), height(0) {};
    NppStSize32u(NppSt32u width, NppSt32u height) : width(width), height(height) {}
#endif
};


/**
 * Error Status Codes
 *
 * Almost all NPP function return error-status information using
 * these return codes.
 * Negative return codes indicate errors, positive return codes indicate
 * warnings, a return code of 0 indicates success.
 */
enum NppStStatus
{
    //already present in NPP
 /*   NPP_SUCCESS                      = 0,   ///< Successful operation (same as NPP_NO_ERROR)
    NPP_ERROR                        = -1,  ///< Unknown error
    NPP_CUDA_KERNEL_EXECUTION_ERROR  = -3,  ///< CUDA kernel execution error
    NPP_NULL_POINTER_ERROR           = -4,  ///< NULL pointer argument error
    NPP_TEXTURE_BIND_ERROR           = -24, ///< CUDA texture binding error or non-zero offset returned
    NPP_MEMCPY_ERROR                 = -13, ///< CUDA memory copy error
    NPP_MEM_ALLOC_ERR                = -12, ///< CUDA memory allocation error
    NPP_MEMFREE_ERR                  = -15, ///< CUDA memory deallocation error*/

    //to be added
    NPP_INVALID_ROI,                        ///< Invalid region of interest argument
    NPP_INVALID_STEP,                       ///< Invalid image lines step argument (check sign, alignment, relation to image width)
    NPP_INVALID_SCALE,                      ///< Invalid scale parameter passed
    NPP_MEM_INSUFFICIENT_BUFFER,            ///< Insufficient user-allocated buffer
    NPP_MEM_RESIDENCE_ERROR,                ///< Memory residence error detected (check if pointers should be device or pinned)
    NPP_MEM_INTERNAL_ERROR,                 ///< Internal memory management error
};


/*@}*/


#ifdef __cplusplus


/** \defgroup ct_typesize_checks Client-side sizeof types compile-time check
* @{
*/
    NPPST_CT_ASSERT(sizeof(NppStBool) <= 4);
    NPPST_CT_ASSERT(sizeof(NppSt64s) == 8);
    NPPST_CT_ASSERT(sizeof(NppSt64u) == 8);
    NPPST_CT_ASSERT(sizeof(NppSt32s) == 4);
    NPPST_CT_ASSERT(sizeof(NppSt32u) == 4);
    NPPST_CT_ASSERT(sizeof(NppSt16s) == 2);
    NPPST_CT_ASSERT(sizeof(NppSt16u) == 2);
    NPPST_CT_ASSERT(sizeof(NppSt8s) == 1);
    NPPST_CT_ASSERT(sizeof(NppSt8u) == 1);
    NPPST_CT_ASSERT(sizeof(NppSt32f) == 4);
    NPPST_CT_ASSERT(sizeof(NppSt64f) == 8);
    NPPST_CT_ASSERT(sizeof(NppStRect8u) == sizeof(NppSt32u));
    NPPST_CT_ASSERT(sizeof(NppStRect32s) == 4 * sizeof(NppSt32s));
    NPPST_CT_ASSERT(sizeof(NppStRect32u) == 4 * sizeof(NppSt32u));
    NPPST_CT_ASSERT(sizeof(NppStSize32u) == 2 * sizeof(NppSt32u));
/*@}*/


#endif


#ifdef __cplusplus
extern "C" {
#endif


/** \defgroup core_npp NPP Core
 * Basic functions for CUDA streams management.
 * WARNING: These functions couldn't be exported from NPP_staging library, so they can't be used
 * @{
 */


/**
 * Gets an active CUDA stream used by NPP (Not an API yet!)
 * \return Current CUDA stream
 */
cudaStream_t nppStGetActiveCUDAstream();


/**
 * Sets an active CUDA stream used by NPP (Not an API yet!)
 * \param cudaStream        [IN] cudaStream CUDA stream to become current
 * \return CUDA stream used before
 */
cudaStream_t nppStSetActiveCUDAstream(cudaStream_t cudaStream);


/*@}*/


/** \defgroup nppi NPP Image Processing
* @{
*/


/**
 * Downsamples (decimates) an image using the nearest neighbor algorithm. 32-bit unsigned pixels, single channel.
 *
 * \param d_src             [IN] Source image pointer (CUDA device memory)
