<?xml version="1.0" ?>
<net batch="1" name="test_Convolution" version="4">
	<layers>
		<layer id="0" name="input" precision="FP16" type="Input">
			<output>
				<port id="0">
					<dim>2</dim>
					<dim>6</dim>
					<dim>75</dim>
					<dim>113</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="output" precision="FP16" type="Convolution">
			<data dilations="1,1" group="3" kernel="4,5" output="12" pads_begin="0,1" pads_end="0,1" strides="2,3"/>
			<input>
				<port id="0">
					<dim>2</dim>
					<dim>6</dim>
					<dim>75</dim>
					<dim>113</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>2</dim>
					<dim>12</dim>
					<dim>36</dim>
					<dim>37</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="960"/>
				<biases offset="960" size="24"/>
			</blobs>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="1.5.12.49d067a0"/>
		<cli_parameters>
			<data_type value="FP16"/>
			<disable_fusing value="False"/>
			<disable_gfusing value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<extensions value="DIR"/>
			<framework value="caffe"/>
			<generate_deprecated_IR_V2 value="False"/>
			<input_model value="DIR/layer_convolution.caffemodel"/>
			<input_proto value="DIR/layer_convolution.prototxt"/>
			<k value="DIR/CustomLayersMapping.xml"/>
			<log_level value="ERROR"/>
			<mean_values value="()"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<reverse_input_channels value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<version value="False"/>
			<unset unset_cli_parameters="batch, finegrain_fusing, freeze_placeholder_with_value, input, input_shape, mean_file, mean_file_offsets, model_name, output, scale"/>
		</cli_parameters>
	</meta_data>
</net>
