name: "test_InnerProduct"
input: "input"

input_dim: 2
input_dim: 6
input_dim: 75
input_dim: 113

# 2x6x75x113 -> 2x6x10
layer {
  type: "InnerProduct"
  inner_product_param
  {
    axis: 2
    num_output: 10
    weight_filler {
      type: "xavier"
      std: 0.1
    }
    bias_filler {
      type: 'uniform'
      min: -1
      max: 1
    }
  }
  name: "fc1"
  bottom: "input"
  top: "fc1"
}

# 2x6x10 -> 2x20
layer {
  type: "InnerProduct"

  inner_product_param
  {
    axis: 1
    num_output: 20

    weight_filler {
      type: "xavier"
      std: 0.1
    }
    bias_filler {
      type: 'uniform'
      min: -1
      max: 1
    }
  }

  name: "fc2"
  bottom: "fc1"
  top: "fc2"
}

layer {
  type: "Scale"
  scale_param { bias_term: true }

  name: "output"
  bottom: "fc2"
  top: "output"
}
