name: "test_Convolution"
input: "input"

input_dim: 2
input_dim: 6
input_dim: 75
input_dim: 113

layer {
  type: "Convolution"

  convolution_param
  {
  	group: 3
    num_output: 12

  	pad_h: 0
  	pad_w: 1
  	kernel_h: 4
  	kernel_w: 5
  	stride_h: 2
  	stride_w: 3

    weight_filler{
      type: 'uniform'
      min: -1
      max: 1
    }
    bias_filler {
      type: 'uniform'
      min: -1
      max: 1
    }
  }

  name: "output"
  bottom: "input"
  top: "output"
}