name: "test_InnerProduct"
input: "input"

input_dim: 2
input_dim: 6
input_dim: 75
input_dim: 113

layer {
  type: "InnerProduct"

  inner_product_param
  {
    axis: 3
    num_output: 2

    weight_filler{
      type: 'uniform'
      min: -1
      max: 1
    }
    bias_filler {
      type: 'uniform'
      min: -1
      max: 1
    }
  }

  name: "output"
  bottom: "input"
  top: "output"
}