name: "test_MVN_channels"
input: "input"

input_dim: 2
input_dim: 6
input_dim: 75
input_dim: 113

layer {
  type: "MVN"

  mvn_param {
  	eps: 1e-5
    across_channels: false
    normalize_variance: true
  }

  name: "output"
  bottom: "input"
  top: "output"
}
