[net]
batch=1
channels=3
height=4
width=6

#for SAME padding set "pad" to 1, for manual padding set "padding" to desired value.
[convolutional]
filters=4
size=3
stride=2
pad=1
activation=leaky

#Convolution layer
[convolutional]
filters=5
size=3
stride=1
padding=1
activation=leaky

[convolutional]
filters=5
size=3
stride=1
padding=1
activation=logistic

[convolutional]
filters=16
size=3
stride=1
padding=1
activation=swish

# grouped convolution
[convolutional]
groups=4
filters=16
size=3
stride=1
padding=1
activation=leaky

# depthwise convolution
[convolutional]
groups=16
filters=16
size=3
stride=1
padding=1
activation=leaky