[net]
batch=1
channels=3
height=4
width=6

#for SAME padding set pad=0, for manual padding set padding to desired value.
[convolutional]
filters=4
size=3
stride=2
pad=1
activation=leaky

#Convolution layer
[convolutional]
filters=5
size=3
stride=1
padding=1
activation=leaky
