node {
  name: "image_arrays"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 512
        }
        dim {
          size: 512
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "ExpandDims_3/_3__cf__3/inv"
  op: "Const"
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        float_val: 4.366812186156496
        float_val: 4.464285576487991
        float_val: 4.444444562182017
        tensor_shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "truediv"
  op: "Mul"
  input: "image_arrays"
  input: "ExpandDims_3/_3__cf__3/inv"
}
node {
  name: "efficientnet-b0/stem/conv2d/Conv2D"
  op: "Conv2D"
  input: "truediv"
  input: "efficientnet-b0/stem/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/stem/tpu_batch_normalization/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b0/stem/conv2d/Conv2D"
  input: "efficientnet-b0/stem/tpu_batch_normalization/gamma"
  input: "efficientnet-b0/stem/tpu_batch_normalization/beta"
  input: "efficientnet-b0/stem/tpu_batch_normalization/moving_mean"
  input: "efficientnet-b0/stem/tpu_batch_normalization/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b0/stem/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet-b0/stem/tpu_batch_normalization/FusedBatchNormV3"
}
node {
  name: "efficientnet-b0/stem/mul"
  op: "Mul"
  input: "efficientnet-b0/stem/tpu_batch_normalization/FusedBatchNormV3"
  input: "efficientnet-b0/stem/Sigmoid"
}
node {
  name: "efficientnet-b0/blocks_0/depthwise_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "efficientnet-b0/stem/mul"
  input: "efficientnet-b0/blocks_0/depthwise_conv2d/depthwise_kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_0/tpu_batch_normalization/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b0/blocks_0/depthwise_conv2d/depthwise"
  input: "efficientnet-b0/blocks_0/tpu_batch_normalization/gamma"
  input: "efficientnet-b0/blocks_0/tpu_batch_normalization/beta"
  input: "efficientnet-b0/blocks_0/tpu_batch_normalization/moving_mean"
  input: "efficientnet-b0/blocks_0/tpu_batch_normalization/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b0/blocks_0/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet-b0/blocks_0/tpu_batch_normalization/FusedBatchNormV3"
}
node {
  name: "efficientnet-b0/blocks_0/mul"
  op: "Mul"
  input: "efficientnet-b0/blocks_0/tpu_batch_normalization/FusedBatchNormV3"
  input: "efficientnet-b0/blocks_0/Sigmoid"
}
node {
  name: "efficientnet-b0/blocks_0/se/Mean"
  op: "Mean"
  input: "efficientnet-b0/blocks_0/mul"
  input: "efficientnet-b0/blocks_0/se/Mean/reduction_indices"
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "efficientnet-b0/blocks_0/se/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b0/blocks_0/se/Mean"
  input: "efficientnet-b0/blocks_0/se/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_0/se/conv2d/BiasAdd"
  op: "BiasAdd"
  input: "efficientnet-b0/blocks_0/se/conv2d/Conv2D"
  input: "efficientnet-b0/blocks_0/se/conv2d/bias"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "efficientnet-b0/blocks_0/se/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet-b0/blocks_0/se/conv2d/BiasAdd"
}
node {
  name: "efficientnet-b0/blocks_0/se/mul"
  op: "Mul"
  input: "efficientnet-b0/blocks_0/se/conv2d/BiasAdd"
  input: "efficientnet-b0/blocks_0/se/Sigmoid"
}
node {
  name: "efficientnet-b0/blocks_0/se/conv2d_1/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b0/blocks_0/se/mul"
  input: "efficientnet-b0/blocks_0/se/conv2d_1/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_0/se/conv2d_1/BiasAdd"
  op: "BiasAdd"
  input: "efficientnet-b0/blocks_0/se/conv2d_1/Conv2D"
  input: "efficientnet-b0/blocks_0/se/conv2d_1/bias"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "efficientnet-b0/blocks_0/se/Sigmoid_1"
  op: "Sigmoid"
  input: "efficientnet-b0/blocks_0/se/conv2d_1/BiasAdd"
}
node {
  name: "efficientnet-b0/blocks_0/se/mul_1"
  op: "Mul"
  input: "efficientnet-b0/blocks_0/mul"
  input: "efficientnet-b0/blocks_0/se/Sigmoid_1"
}
node {
  name: "efficientnet-b0/blocks_0/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b0/blocks_0/se/mul_1"
  input: "efficientnet-b0/blocks_0/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_0/tpu_batch_normalization_1/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b0/blocks_0/conv2d/Conv2D"
  input: "efficientnet-b0/blocks_0/tpu_batch_normalization_1/gamma"
  input: "efficientnet-b0/blocks_0/tpu_batch_normalization_1/beta"
  input: "efficientnet-b0/blocks_0/tpu_batch_normalization_1/moving_mean"
  input: "efficientnet-b0/blocks_0/tpu_batch_normalization_1/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b0/blocks_1/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b0/blocks_0/tpu_batch_normalization_1/FusedBatchNormV3"
  input: "efficientnet-b0/blocks_1/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_1/tpu_batch_normalization/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b0/blocks_1/conv2d/Conv2D"
  input: "efficientnet-b0/blocks_1/tpu_batch_normalization/gamma"
  input: "efficientnet-b0/blocks_1/tpu_batch_normalization/beta"
  input: "efficientnet-b0/blocks_1/tpu_batch_normalization/moving_mean"
  input: "efficientnet-b0/blocks_1/tpu_batch_normalization/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b0/blocks_1/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet-b0/blocks_1/tpu_batch_normalization/FusedBatchNormV3"
}
node {
  name: "efficientnet-b0/blocks_1/mul"
  op: "Mul"
  input: "efficientnet-b0/blocks_1/tpu_batch_normalization/FusedBatchNormV3"
  input: "efficientnet-b0/blocks_1/Sigmoid"
}
node {
  name: "efficientnet-b0/blocks_1/depthwise_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "efficientnet-b0/blocks_1/mul"
  input: "efficientnet-b0/blocks_1/depthwise_conv2d/depthwise_kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_1/tpu_batch_normalization_1/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b0/blocks_1/depthwise_conv2d/depthwise"
  input: "efficientnet-b0/blocks_1/tpu_batch_normalization_1/gamma"
  input: "efficientnet-b0/blocks_1/tpu_batch_normalization_1/beta"
  input: "efficientnet-b0/blocks_1/tpu_batch_normalization_1/moving_mean"
  input: "efficientnet-b0/blocks_1/tpu_batch_normalization_1/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b0/blocks_1/Sigmoid_1"
  op: "Sigmoid"
  input: "efficientnet-b0/blocks_1/tpu_batch_normalization_1/FusedBatchNormV3"
}
node {
  name: "efficientnet-b0/blocks_1/mul_1"
  op: "Mul"
  input: "efficientnet-b0/blocks_1/tpu_batch_normalization_1/FusedBatchNormV3"
  input: "efficientnet-b0/blocks_1/Sigmoid_1"
}
node {
  name: "efficientnet-b0/blocks_1/se/Mean"
  op: "Mean"
  input: "efficientnet-b0/blocks_1/mul_1"
  input: "efficientnet-b0/blocks_1/se/Mean/reduction_indices"
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "efficientnet-b0/blocks_1/se/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b0/blocks_1/se/Mean"
  input: "efficientnet-b0/blocks_1/se/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_1/se/conv2d/BiasAdd"
  op: "BiasAdd"
  input: "efficientnet-b0/blocks_1/se/conv2d/Conv2D"
  input: "efficientnet-b0/blocks_1/se/conv2d/bias"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "efficientnet-b0/blocks_1/se/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet-b0/blocks_1/se/conv2d/BiasAdd"
}
node {
  name: "efficientnet-b0/blocks_1/se/mul"
  op: "Mul"
  input: "efficientnet-b0/blocks_1/se/conv2d/BiasAdd"
  input: "efficientnet-b0/blocks_1/se/Sigmoid"
}
node {
  name: "efficientnet-b0/blocks_1/se/conv2d_1/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b0/blocks_1/se/mul"
  input: "efficientnet-b0/blocks_1/se/conv2d_1/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_1/se/conv2d_1/BiasAdd"
  op: "BiasAdd"
  input: "efficientnet-b0/blocks_1/se/conv2d_1/Conv2D"
  input: "efficientnet-b0/blocks_1/se/conv2d_1/bias"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "efficientnet-b0/blocks_1/se/Sigmoid_1"
  op: "Sigmoid"
  input: "efficientnet-b0/blocks_1/se/conv2d_1/BiasAdd"
}
node {
  name: "efficientnet-b0/blocks_1/se/mul_1"
  op: "Mul"
  input: "efficientnet-b0/blocks_1/mul_1"
  input: "efficientnet-b0/blocks_1/se/Sigmoid_1"
}
node {
  name: "efficientnet-b0/blocks_1/conv2d_1/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b0/blocks_1/se/mul_1"
  input: "efficientnet-b0/blocks_1/conv2d_1/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_1/tpu_batch_normalization_2/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b0/blocks_1/conv2d_1/Conv2D"
  input: "efficientnet-b0/blocks_1/tpu_batch_normalization_2/gamma"
  input: "efficientnet-b0/blocks_1/tpu_batch_normalization_2/beta"
  input: "efficientnet-b0/blocks_1/tpu_batch_normalization_2/moving_mean"
  input: "efficientnet-b0/blocks_1/tpu_batch_normalization_2/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b0/blocks_2/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b0/blocks_1/tpu_batch_normalization_2/FusedBatchNormV3"
  input: "efficientnet-b0/blocks_2/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_2/tpu_batch_normalization/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b0/blocks_2/conv2d/Conv2D"
  input: "efficientnet-b0/blocks_2/tpu_batch_normalization/gamma"
  input: "efficientnet-b0/blocks_2/tpu_batch_normalization/beta"
  input: "efficientnet-b0/blocks_2/tpu_batch_normalization/moving_mean"
  input: "efficientnet-b0/blocks_2/tpu_batch_normalization/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b0/blocks_2/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet-b0/blocks_2/tpu_batch_normalization/FusedBatchNormV3"
}
node {
  name: "efficientnet-b0/blocks_2/mul"
  op: "Mul"
  input: "efficientnet-b0/blocks_2/tpu_batch_normalization/FusedBatchNormV3"
  input: "efficientnet-b0/blocks_2/Sigmoid"
}
node {
  name: "efficientnet-b0/blocks_2/depthwise_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "efficientnet-b0/blocks_2/mul"
  input: "efficientnet-b0/blocks_2/depthwise_conv2d/depthwise_kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_2/tpu_batch_normalization_1/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b0/blocks_2/depthwise_conv2d/depthwise"
  input: "efficientnet-b0/blocks_2/tpu_batch_normalization_1/gamma"
  input: "efficientnet-b0/blocks_2/tpu_batch_normalization_1/beta"
  input: "efficientnet-b0/blocks_2/tpu_batch_normalization_1/moving_mean"
  input: "efficientnet-b0/blocks_2/tpu_batch_normalization_1/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b0/blocks_2/Sigmoid_1"
  op: "Sigmoid"
  input: "efficientnet-b0/blocks_2/tpu_batch_normalization_1/FusedBatchNormV3"
}
node {
  name: "efficientnet-b0/blocks_2/mul_1"
  op: "Mul"
  input: "efficientnet-b0/blocks_2/tpu_batch_normalization_1/FusedBatchNormV3"
  input: "efficientnet-b0/blocks_2/Sigmoid_1"
}
node {
  name: "efficientnet-b0/blocks_2/se/Mean"
  op: "Mean"
  input: "efficientnet-b0/blocks_2/mul_1"
  input: "efficientnet-b0/blocks_2/se/Mean/reduction_indices"
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "efficientnet-b0/blocks_2/se/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b0/blocks_2/se/Mean"
  input: "efficientnet-b0/blocks_2/se/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_2/se/conv2d/BiasAdd"
  op: "BiasAdd"
  input: "efficientnet-b0/blocks_2/se/conv2d/Conv2D"
  input: "efficientnet-b0/blocks_2/se/conv2d/bias"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "efficientnet-b0/blocks_2/se/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet-b0/blocks_2/se/conv2d/BiasAdd"
}
node {
  name: "efficientnet-b0/blocks_2/se/mul"
  op: "Mul"
  input: "efficientnet-b0/blocks_2/se/conv2d/BiasAdd"
  input: "efficientnet-b0/blocks_2/se/Sigmoid"
}
node {
  name: "efficientnet-b0/blocks_2/se/conv2d_1/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b0/blocks_2/se/mul"
  input: "efficientnet-b0/blocks_2/se/conv2d_1/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_2/se/conv2d_1/BiasAdd"
  op: "BiasAdd"
  input: "efficientnet-b0/blocks_2/se/conv2d_1/Conv2D"
  input: "efficientnet-b0/blocks_2/se/conv2d_1/bias"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "efficientnet-b0/blocks_2/se/Sigmoid_1"
  op: "Sigmoid"
  input: "efficientnet-b0/blocks_2/se/conv2d_1/BiasAdd"
}
node {
  name: "efficientnet-b0/blocks_2/se/mul_1"
  op: "Mul"
  input: "efficientnet-b0/blocks_2/mul_1"
  input: "efficientnet-b0/blocks_2/se/Sigmoid_1"
}
node {
  name: "efficientnet-b0/blocks_2/conv2d_1/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b0/blocks_2/se/mul_1"
  input: "efficientnet-b0/blocks_2/conv2d_1/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_2/tpu_batch_normalization_2/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b0/blocks_2/conv2d_1/Conv2D"
  input: "efficientnet-b0/blocks_2/tpu_batch_normalization_2/gamma"
  input: "efficientnet-b0/blocks_2/tpu_batch_normalization_2/beta"
  input: "efficientnet-b0/blocks_2/tpu_batch_normalization_2/moving_mean"
  input: "efficientnet-b0/blocks_2/tpu_batch_normalization_2/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b0/blocks_2/Add"
  op: "Add"
  input: "efficientnet-b0/blocks_2/tpu_batch_normalization_2/FusedBatchNormV3"
  input: "efficientnet-b0/blocks_1/tpu_batch_normalization_2/FusedBatchNormV3"
}
node {
  name: "efficientnet-b0/blocks_3/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b0/blocks_2/Add"
  input: "efficientnet-b0/blocks_3/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_3/tpu_batch_normalization/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b0/blocks_3/conv2d/Conv2D"
  input: "efficientnet-b0/blocks_3/tpu_batch_normalization/gamma"
  input: "efficientnet-b0/blocks_3/tpu_batch_normalization/beta"
  input: "efficientnet-b0/blocks_3/tpu_batch_normalization/moving_mean"
  input: "efficientnet-b0/blocks_3/tpu_batch_normalization/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b0/blocks_3/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet-b0/blocks_3/tpu_batch_normalization/FusedBatchNormV3"
}
node {
  name: "efficientnet-b0/blocks_3/mul"
  op: "Mul"
  input: "efficientnet-b0/blocks_3/tpu_batch_normalization/FusedBatchNormV3"
  input: "efficientnet-b0/blocks_3/Sigmoid"
}
node {
  name: "efficientnet-b0/blocks_3/depthwise_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "efficientnet-b0/blocks_3/mul"
  input: "efficientnet-b0/blocks_3/depthwise_conv2d/depthwise_kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_3/tpu_batch_normalization_1/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b0/blocks_3/depthwise_conv2d/depthwise"
  input: "efficientnet-b0/blocks_3/tpu_batch_normalization_1/gamma"
  input: "efficientnet-b0/blocks_3/tpu_batch_normalization_1/beta"
  input: "efficientnet-b0/blocks_3/tpu_batch_normalization_1/moving_mean"
  input: "efficientnet-b0/blocks_3/tpu_batch_normalization_1/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b0/blocks_3/Sigmoid_1"
  op: "Sigmoid"
  input: "efficientnet-b0/blocks_3/tpu_batch_normalization_1/FusedBatchNormV3"
}
node {
  name: "efficientnet-b0/blocks_3/mul_1"
  op: "Mul"
  input: "efficientnet-b0/blocks_3/tpu_batch_normalization_1/FusedBatchNormV3"
  input: "efficientnet-b0/blocks_3/Sigmoid_1"
}
node {
  name: "efficientnet-b0/blocks_3/se/Mean"
  op: "Mean"
  input: "efficientnet-b0/blocks_3/mul_1"
  input: "efficientnet-b0/blocks_3/se/Mean/reduction_indices"
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "efficientnet-b0/blocks_3/se/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b0/blocks_3/se/Mean"
  input: "efficientnet-b0/blocks_3/se/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_3/se/conv2d/BiasAdd"
  op: "BiasAdd"
  input: "efficientnet-b0/blocks_3/se/conv2d/Conv2D"
  input: "efficientnet-b0/blocks_3/se/conv2d/bias"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "efficientnet-b0/blocks_3/se/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet-b0/blocks_3/se/conv2d/BiasAdd"
}
node {
  name: "efficientnet-b0/blocks_3/se/mul"
  op: "Mul"
  input: "efficientnet-b0/blocks_3/se/conv2d/BiasAdd"
  input: "efficientnet-b0/blocks_3/se/Sigmoid"
}
node {
  name: "efficientnet-b0/blocks_3/se/conv2d_1/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b0/blocks_3/se/mul"
  input: "efficientnet-b0/blocks_3/se/conv2d_1/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_3/se/conv2d_1/BiasAdd"
  op: "BiasAdd"
  input: "efficientnet-b0/blocks_3/se/conv2d_1/Conv2D"
  input: "efficientnet-b0/blocks_3/se/conv2d_1/bias"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "efficientnet-b0/blocks_3/se/Sigmoid_1"
  op: "Sigmoid"
  input: "efficientnet-b0/blocks_3/se/conv2d_1/BiasAdd"
}
node {
  name: "efficientnet-b0/blocks_3/se/mul_1"
  op: "Mul"
  input: "efficientnet-b0/blocks_3/mul_1"
  input: "efficientnet-b0/blocks_3/se/Sigmoid_1"
}
node {
  name: "efficientnet-b0/blocks_3/conv2d_1/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b0/blocks_3/se/mul_1"
  input: "efficientnet-b0/blocks_3/conv2d_1/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_3/tpu_batch_normalization_2/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b0/blocks_3/conv2d_1/Conv2D"
  input: "efficientnet-b0/blocks_3/tpu_batch_normalization_2/gamma"
  input: "efficientnet-b0/blocks_3/tpu_batch_normalization_2/beta"
  input: "efficientnet-b0/blocks_3/tpu_batch_normalization_2/moving_mean"
  input: "efficientnet-b0/blocks_3/tpu_batch_normalization_2/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b0/blocks_4/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b0/blocks_3/tpu_batch_normalization_2/FusedBatchNormV3"
  input: "efficientnet-b0/blocks_4/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_4/tpu_batch_normalization/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b0/blocks_4/conv2d/Conv2D"
  input: "efficientnet-b0/blocks_4/tpu_batch_normalization/gamma"
  input: "efficientnet-b0/blocks_4/tpu_batch_normalization/beta"
  input: "efficientnet-b0/blocks_4/tpu_batch_normalization/moving_mean"
  input: "efficientnet-b0/blocks_4/tpu_batch_normalization/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b0/blocks_4/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet-b0/blocks_4/tpu_batch_normalization/FusedBatchNormV3"
}
node {
  name: "efficientnet-b0/blocks_4/mul"
  op: "Mul"
  input: "efficientnet-b0/blocks_4/tpu_batch_normalization/FusedBatchNormV3"
  input: "efficientnet-b0/blocks_4/Sigmoid"
}
node {
  name: "efficientnet-b0/blocks_4/depthwise_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "efficientnet-b0/blocks_4/mul"
  input: "efficientnet-b0/blocks_4/depthwise_conv2d/depthwise_kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_4/tpu_batch_normalization_1/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b0/blocks_4/depthwise_conv2d/depthwise"
  input: "efficientnet-b0/blocks_4/tpu_batch_normalization_1/gamma"
  input: "efficientnet-b0/blocks_4/tpu_batch_normalization_1/beta"
  input: "efficientnet-b0/blocks_4/tpu_batch_normalization_1/moving_mean"
  input: "efficientnet-b0/blocks_4/tpu_batch_normalization_1/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b0/blocks_4/Sigmoid_1"
  op: "Sigmoid"
  input: "efficientnet-b0/blocks_4/tpu_batch_normalization_1/FusedBatchNormV3"
}
node {
  name: "efficientnet-b0/blocks_4/mul_1"
  op: "Mul"
  input: "efficientnet-b0/blocks_4/tpu_batch_normalization_1/FusedBatchNormV3"
  input: "efficientnet-b0/blocks_4/Sigmoid_1"
}
node {
  name: "efficientnet-b0/blocks_4/se/Mean"
  op: "Mean"
  input: "efficientnet-b0/blocks_4/mul_1"
  input: "efficientnet-b0/blocks_4/se/Mean/reduction_indices"
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "efficientnet-b0/blocks_4/se/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b0/blocks_4/se/Mean"
  input: "efficientnet-b0/blocks_4/se/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_4/se/conv2d/BiasAdd"
  op: "BiasAdd"
  input: "efficientnet-b0/blocks_4/se/conv2d/Conv2D"
  input: "efficientnet-b0/blocks_4/se/conv2d/bias"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "efficientnet-b0/blocks_4/se/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet-b0/blocks_4/se/conv2d/BiasAdd"
}
node {
  name: "efficientnet-b0/blocks_4/se/mul"
  op: "Mul"
  input: "efficientnet-b0/blocks_4/se/conv2d/BiasAdd"
  input: "efficientnet-b0/blocks_4/se/Sigmoid"
}
node {
  name: "efficientnet-b0/blocks_4/se/conv2d_1/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b0/blocks_4/se/mul"
  input: "efficientnet-b0/blocks_4/se/conv2d_1/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_4/se/conv2d_1/BiasAdd"
  op: "BiasAdd"
  input: "efficientnet-b0/blocks_4/se/conv2d_1/Conv2D"
  input: "efficientnet-b0/blocks_4/se/conv2d_1/bias"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "efficientnet-b0/blocks_4/se/Sigmoid_1"
  op: "Sigmoid"
  input: "efficientnet-b0/blocks_4/se/conv2d_1/BiasAdd"
}
node {
  name: "efficientnet-b0/blocks_4/se/mul_1"
  op: "Mul"
  input: "efficientnet-b0/blocks_4/mul_1"
  input: "efficientnet-b0/blocks_4/se/Sigmoid_1"
}
node {
  name: "efficientnet-b0/blocks_4/conv2d_1/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b0/blocks_4/se/mul_1"
  input: "efficientnet-b0/blocks_4/conv2d_1/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_4/tpu_batch_normalization_2/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b0/blocks_4/conv2d_1/Conv2D"
  input: "efficientnet-b0/blocks_4/tpu_batch_normalization_2/gamma"
  input: "efficientnet-b0/blocks_4/tpu_batch_normalization_2/beta"
  input: "efficientnet-b0/blocks_4/tpu_batch_normalization_2/moving_mean"
  input: "efficientnet-b0/blocks_4/tpu_batch_normalization_2/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b0/blocks_4/Add"
  op: "Add"
  input: "efficientnet-b0/blocks_4/tpu_batch_normalization_2/FusedBatchNormV3"
  input: "efficientnet-b0/blocks_3/tpu_batch_normalization_2/FusedBatchNormV3"
}
node {
  name: "fpn_cells/cell_0/fnode3/resample_0_0_8/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b0/blocks_4/Add"
  input: "fpn_cells/cell_0/fnode3/resample_0_0_8/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "fpn_cells/cell_0/fnode3/resample_0_0_8/conv2d/BiasAdd"
  op: "BiasAdd"
  input: "fpn_cells/cell_0/fnode3/resample_0_0_8/conv2d/Conv2D"
  input: "fpn_cells/cell_0/fnode3/resample_0_0_8/conv2d/bias"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "fpn_cells/cell_0/fnode3/resample_0_0_8/bn/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "fpn_cells/cell_0/fnode3/resample_0_0_8/conv2d/BiasAdd"
  input: "fpn_cells/cell_0/fnode3/resample_0_0_8/bn/gamma"
  input: "fpn_cells/cell_0/fnode3/resample_0_0_8/bn/beta"
  input: "fpn_cells/cell_0/fnode3/resample_0_0_8/bn/moving_mean"
  input: "fpn_cells/cell_0/fnode3/resample_0_0_8/bn/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "fpn_cells/cell_0/fnode3/mul"
  op: "Mul"
  input: "fpn_cells/cell_0/fnode3/resample_0_0_8/bn/FusedBatchNormV3"
  input: "fpn_cells/cell_0/fnode3/Relu/_16__cf__16"
}
node {
  name: "fpn_cells/cell_0/fnode3/truediv"
  op: "Mul"
  input: "fpn_cells/cell_0/fnode3/mul"
  input: "fpn_cells/cell_0/fnode3/add/_18__cf__18/inv"
}
node {
  name: "efficientnet-b0/blocks_5/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b0/blocks_4/Add"
  input: "efficientnet-b0/blocks_5/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_5/tpu_batch_normalization/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b0/blocks_5/conv2d/Conv2D"
  input: "efficientnet-b0/blocks_5/tpu_batch_normalization/gamma"
  input: "efficientnet-b0/blocks_5/tpu_batch_normalization/beta"
  input: "efficientnet-b0/blocks_5/tpu_batch_normalization/moving_mean"
  input: "efficientnet-b0/blocks_5/tpu_batch_normalization/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b0/blocks_5/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet-b0/blocks_5/tpu_batch_normalization/FusedBatchNormV3"
}
node {
  name: "efficientnet-b0/blocks_5/mul"
  op: "Mul"
  input: "efficientnet-b0/blocks_5/tpu_batch_normalization/FusedBatchNormV3"
  input: "efficientnet-b0/blocks_5/Sigmoid"
}
node {
  name: "efficientnet-b0/blocks_5/depthwise_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "efficientnet-b0/blocks_5/mul"
  input: "efficientnet-b0/blocks_5/depthwise_conv2d/depthwise_kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_5/tpu_batch_normalization_1/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b0/blocks_5/depthwise_conv2d/depthwise"
  input: "efficientnet-b0/blocks_5/tpu_batch_normalization_1/gamma"
  input: "efficientnet-b0/blocks_5/tpu_batch_normalization_1/beta"
  input: "efficientnet-b0/blocks_5/tpu_batch_normalization_1/moving_mean"
  input: "efficientnet-b0/blocks_5/tpu_batch_normalization_1/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b0/blocks_5/Sigmoid_1"
  op: "Sigmoid"
  input: "efficientnet-b0/blocks_5/tpu_batch_normalization_1/FusedBatchNormV3"
}
node {
  name: "efficientnet-b0/blocks_5/mul_1"
  op: "Mul"
  input: "efficientnet-b0/blocks_5/tpu_batch_normalization_1/FusedBatchNormV3"
  input: "efficientnet-b0/blocks_5/Sigmoid_1"
}
node {
  name: "efficientnet-b0/blocks_5/se/Mean"
  op: "Mean"
  input: "efficientnet-b0/blocks_5/mul_1"
  input: "efficientnet-b0/blocks_5/se/Mean/reduction_indices"
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "efficientnet-b0/blocks_5/se/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b0/blocks_5/se/Mean"
  input: "efficientnet-b0/blocks_5/se/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_5/se/conv2d/BiasAdd"
  op: "BiasAdd"
  input: "efficientnet-b0/blocks_5/se/conv2d/Conv2D"
  input: "efficientnet-b0/blocks_5/se/conv2d/bias"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "efficientnet-b0/blocks_5/se/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet-b0/blocks_5/se/conv2d/BiasAdd"
}
node {
  name: "efficientnet-b0/blocks_5/se/mul"
  op: "Mul"
  input: "efficientnet-b0/blocks_5/se/conv2d/BiasAdd"
  input: "efficientnet-b0/blocks_5/se/Sigmoid"
}
node {
  name: "efficientnet-b0/blocks_5/se/conv2d_1/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b0/blocks_5/se/mul"
  input: "efficientnet-b0/blocks_5/se/conv2d_1/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_5/se/conv2d_1/BiasAdd"
  op: "BiasAdd"
  input: "efficientnet-b0/blocks_5/se/conv2d_1/Conv2D"
  input: "efficientnet-b0/blocks_5/se/conv2d_1/bias"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "efficientnet-b0/blocks_5/se/Sigmoid_1"
  op: "Sigmoid"
  input: "efficientnet-b0/blocks_5/se/conv2d_1/BiasAdd"
}
node {
  name: "efficientnet-b0/blocks_5/se/mul_1"
  op: "Mul"
  input: "efficientnet-b0/blocks_5/mul_1"
  input: "efficientnet-b0/blocks_5/se/Sigmoid_1"
}
node {
  name: "efficientnet-b0/blocks_5/conv2d_1/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b0/blocks_5/se/mul_1"
  input: "efficientnet-b0/blocks_5/conv2d_1/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_5/tpu_batch_normalization_2/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b0/blocks_5/conv2d_1/Conv2D"
  input: "efficientnet-b0/blocks_5/tpu_batch_normalization_2/gamma"
  input: "efficientnet-b0/blocks_5/tpu_batch_normalization_2/beta"
  input: "efficientnet-b0/blocks_5/tpu_batch_normalization_2/moving_mean"
  input: "efficientnet-b0/blocks_5/tpu_batch_normalization_2/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b0/blocks_6/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b0/blocks_5/tpu_batch_normalization_2/FusedBatchNormV3"
  input: "efficientnet-b0/blocks_6/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_6/tpu_batch_normalization/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b0/blocks_6/conv2d/Conv2D"
  input: "efficientnet-b0/blocks_6/tpu_batch_normalization/gamma"
  input: "efficientnet-b0/blocks_6/tpu_batch_normalization/beta"
  input: "efficientnet-b0/blocks_6/tpu_batch_normalization/moving_mean"
  input: "efficientnet-b0/blocks_6/tpu_batch_normalization/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b0/blocks_6/Sigmoid"
  op: "Sigmoid"
  input: "efficientnet-b0/blocks_6/tpu_batch_normalization/FusedBatchNormV3"
}
node {
  name: "efficientnet-b0/blocks_6/mul"
  op: "Mul"
  input: "efficientnet-b0/blocks_6/tpu_batch_normalization/FusedBatchNormV3"
  input: "efficientnet-b0/blocks_6/Sigmoid"
}
node {
  name: "efficientnet-b0/blocks_6/depthwise_conv2d/depthwise"
  op: "DepthwiseConv2dNative"
  input: "efficientnet-b0/blocks_6/mul"
  input: "efficientnet-b0/blocks_6/depthwise_conv2d/depthwise_kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_6/tpu_batch_normalization_1/FusedBatchNormV3"
  op: "FusedBatchNormV3"
  input: "efficientnet-b0/blocks_6/depthwise_conv2d/depthwise"
  input: "efficientnet-b0/blocks_6/tpu_batch_normalization_1/gamma"
  input: "efficientnet-b0/blocks_6/tpu_batch_normalization_1/beta"
  input: "efficientnet-b0/blocks_6/tpu_batch_normalization_1/moving_mean"
  input: "efficientnet-b0/blocks_6/tpu_batch_normalization_1/moving_variance"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.001
    }
  }
  attr {
    key: "U"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "efficientnet-b0/blocks_6/Sigmoid_1"
  op: "Sigmoid"
  input: "efficientnet-b0/blocks_6/tpu_batch_normalization_1/FusedBatchNormV3"
}
node {
  name: "efficientnet-b0/blocks_6/mul_1"
  op: "Mul"
  input: "efficientnet-b0/blocks_6/tpu_batch_normalization_1/FusedBatchNormV3"
  input: "efficientnet-b0/blocks_6/Sigmoid_1"
}
node {
  name: "efficientnet-b0/blocks_6/se/Mean"
  op: "Mean"
  input: "efficientnet-b0/blocks_6/mul_1"
  input: "efficientnet-b0/blocks_6/se/Mean/reduction_indices"
  attr {
    key: "keep_dims"
    value {
      b: true
    }
  }
}
node {
  name: "efficientnet-b0/blocks_6/se/conv2d/Conv2D"
  op: "Conv2D"
  input: "efficientnet-b0/blocks_6/se/Mean"
  input: "efficientnet-b0/blocks_6/se/conv2d/kernel"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "explicit_paddings"
    value {
      list {
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "efficientnet-b0/blocks_6/se/conv2d/BiasAdd"
  op: "BiasAdd"
  input: "efficientnet-b0/blocks_6/se/conv2d/Conv2D"
  input: "efficientnet-b0/blocks_6/se/conv2d/bias"
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "efficientnet-b0/blocks_6/se/Sigmoid"
