node {
  name: "image_tensor"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_UINT8
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: -1
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/Conv/Conv2D"
  op: "Conv2D"
  input: "image_tensor"
  input: "FeatureExtractor/MobilenetV2/Conv/weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/Conv/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/Conv/Conv2D"
  input: "FeatureExtractor/MobilenetV2/Conv/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/Conv/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/Conv/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/Conv/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/Conv/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/Conv/BatchNorm/batchnorm/add_1"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FeatureExtractor/MobilenetV2/Conv/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv/depthwise/depthwise_weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv/depthwise/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv/depthwise/depthwise"
  input: "FeatureExtractor/MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv/depthwise/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv/depthwise/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv/depthwise/BatchNorm/batchnorm/add_1"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv/project/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv/depthwise/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv/project/weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv/project/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv/project/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv/project/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv/project/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv/project/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv/project/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv/output"
  op: "Identity"
  input: "FeatureExtractor/MobilenetV2/expanded_conv/project/BatchNorm/batchnorm/add_1"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_1/expand/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv/output"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/expand/weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_1/expand/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/expand/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/expand/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/expand/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/expand/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/expand/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_1/expand/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/expand/BatchNorm/batchnorm/add_1"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/expand/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/depthwise_weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/depthwise"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/BatchNorm/batchnorm/add_1"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_1/project/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/depthwise/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/project/weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_1/project/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/project/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/project/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/project/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/project/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/project/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_1/output"
  op: "Identity"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/project/BatchNorm/batchnorm/add_1"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_2/expand/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/output"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/expand/weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_2/expand/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/expand/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/expand/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/expand/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/expand/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/expand/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_2/expand/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/expand/BatchNorm/batchnorm/add_1"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/expand/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/depthwise_weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/depthwise"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/BatchNorm/batchnorm/add_1"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_2/project/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/depthwise/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/project/weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_2/project/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/project/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/project/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/project/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/project/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/project/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_2/add"
  op: "Add"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/project/BatchNorm/batchnorm/add_1"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_1/output"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_3/input"
  op: "Identity"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_2/add"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_3/expand/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/input"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/expand/weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_3/expand/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/expand/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/expand/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/expand/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/expand/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/expand/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_3/expand/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/expand/BatchNorm/batchnorm/add_1"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/expand/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/depthwise_weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/depthwise"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/BatchNorm/batchnorm/add_1"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_3/project/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/depthwise/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/project/weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_3/project/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/project/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/project/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/project/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/project/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/project/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_3/output"
  op: "Identity"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/project/BatchNorm/batchnorm/add_1"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_4/expand/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/output"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/expand/weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_4/expand/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/expand/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/expand/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/expand/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/expand/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/expand/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_4/expand/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/expand/BatchNorm/batchnorm/add_1"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/expand/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/depthwise_weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/depthwise"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/BatchNorm/batchnorm/add_1"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_4/project/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/depthwise/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/project/weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_4/project/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/project/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/project/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/project/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/project/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/project/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_4/add"
  op: "Add"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/project/BatchNorm/batchnorm/add_1"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_3/output"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_5/input"
  op: "Identity"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_4/add"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_5/expand/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/input"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/expand/weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_5/expand/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/expand/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/expand/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/expand/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/expand/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/expand/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_5/expand/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/expand/BatchNorm/batchnorm/add_1"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/expand/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/depthwise_weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/depthwise"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/BatchNorm/batchnorm/add_1"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_5/project/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/depthwise/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/project/weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_5/project/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/project/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/project/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/project/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/project/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/project/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_5/add"
  op: "Add"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/project/BatchNorm/batchnorm/add_1"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/input"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_6/input"
  op: "Identity"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_5/add"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_6/expand/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/input"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/expand/weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_6/expand/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/expand/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/expand/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/expand/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/expand/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/expand/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_6/expand/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/expand/BatchNorm/batchnorm/add_1"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/expand/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/depthwise_weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/depthwise"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/BatchNorm/batchnorm/add_1"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_6/project/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/depthwise/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/project/weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_6/project/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/project/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/project/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/project/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/project/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/project/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_6/output"
  op: "Identity"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/project/BatchNorm/batchnorm/add_1"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_7/expand/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/output"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/expand/weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_7/expand/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/expand/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/expand/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/expand/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/expand/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/expand/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_7/expand/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/expand/BatchNorm/batchnorm/add_1"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/expand/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/depthwise_weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/depthwise"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/BatchNorm/batchnorm/add_1"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_7/project/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/depthwise/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/project/weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_7/project/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/project/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/project/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/project/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/project/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/project/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_7/add"
  op: "Add"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/project/BatchNorm/batchnorm/add_1"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_6/output"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_8/input"
  op: "Identity"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_7/add"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_8/expand/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/input"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/expand/weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_8/expand/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/expand/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/expand/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/expand/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/expand/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/expand/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_8/expand/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/expand/BatchNorm/batchnorm/add_1"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/expand/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/depthwise_weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/depthwise"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/BatchNorm/batchnorm/add_1"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_8/project/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/depthwise/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/project/weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_8/project/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/project/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/project/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/project/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/project/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/project/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_8/add"
  op: "Add"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/project/BatchNorm/batchnorm/add_1"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/input"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_9/input"
  op: "Identity"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_8/add"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_9/expand/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/input"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/expand/weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_9/expand/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/expand/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/expand/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/expand/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/expand/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/expand/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_9/expand/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/expand/BatchNorm/batchnorm/add_1"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/expand/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/depthwise_weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/depthwise"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/BatchNorm/batchnorm/add_1"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_9/project/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/depthwise/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/project/weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_9/project/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/project/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/project/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/project/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/project/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/project/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_9/add"
  op: "Add"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/project/BatchNorm/batchnorm/add_1"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/input"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_10/input"
  op: "Identity"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_9/add"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_10/expand/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/input"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/expand/weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_10/expand/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/expand/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/expand/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/expand/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/expand/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/expand/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_10/expand/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/expand/BatchNorm/batchnorm/add_1"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/expand/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/depthwise_weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/depthwise"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/BatchNorm/batchnorm/add_1"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_10/project/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/depthwise/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/project/weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_10/project/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/project/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/project/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/project/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/project/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/project/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_10/output"
  op: "Identity"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/project/BatchNorm/batchnorm/add_1"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_11/expand/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/output"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/expand/weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_11/expand/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/expand/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/expand/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/expand/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/expand/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/expand/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_11/expand/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/expand/BatchNorm/batchnorm/add_1"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/depthwise"
  op: "DepthwiseConv2dNative"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/expand/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/depthwise_weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/depthwise"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/Relu6"
  op: "Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/BatchNorm/batchnorm/add_1"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_11/project/Conv2D"
  op: "Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/depthwise/Relu6"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/project/weights"
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_11/project/BatchNorm/batchnorm/add_1"
  op: "FusedBatchNorm"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/project/Conv2D"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/project/BatchNorm/gamma"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/project/BatchNorm/beta"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/project/BatchNorm/moving_mean"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/project/BatchNorm/moving_variance"
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000475
    }
  }
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_11/add"
  op: "Add"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/project/BatchNorm/batchnorm/add_1"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_10/output"
}
node {
  name: "FeatureExtractor/MobilenetV2/expanded_conv_12/input"
  op: "Identity"
  input: "FeatureExtractor/MobilenetV2/expanded_conv_11/add"
}
node {
